{
  "aboutMe": "A propos de moi",
  "skills": "Compétences",
  "experiences": "Expériences",
  "contact": "Contact",
  "projects": "Projets",
  "education": "Formation",
  "languages": "Langues",
  "about-me-content": "En tant que Software Engineer enthousiaste et passionné, j'ai acquis des compétences techniques solides et je suis capable de communiquer efficacement et de m'adapter en travaillant en équipe. Je suis constamment à la recherche de nouveaux défis et de projets innovants, créatifs et ambitieux pour continuer à développer mes compétences et contribuer au succès de l'entreprise.",
  "education-1-title": "Diplôme d'Ingénieur en Informatique",
  "education-1-location": "Paris (75), France",
  "education-1-date": "EPITA, 2022",
  "education-2-title": "Classes Préparatoires PCSI-PC*",
  "education-2-location": "Amiens (80), France",
  "education-2-date": "Lycée Louis Thuillier, 2019",
  "education-3-title": "Baccalauréat Général Filière S",
  "education-3-location": "La-Celle-Saint-Cloud (78), France",
  "education-3-date": "Lycée Pierre Corneille, 2017",
  "skill-1-title": "Front-end",
  "skill-1-content-1": "Application Web: React, TypeScript, JavaScript, HTML5, CSS3, Three.js, Next.js, Angular, Vue.js",
  "skill-1-content-2": "Jeu Vidéo: Unity, C#",
  "skill-1-content-3": "Application Mobile: Kotlin, Swift",
  "skill-1-content-4": "Application de Bureau: ASP.NET, Electron, WPF",
  "skill-2-title": "Back-end",
  "skill-2-content-1": "TypeScript/JavaScript: Node.js, Express.js, Nest.js",
  "skill-2-content-2": "Python: FastAPI",
  "skill-2-content-3": "Java: Spring Boot, Quarkus",
  "skill-2-content-4": "C#: .NET",
  "skill-2-content-5": "C/C++",
  "skill-3-title": "Bases de données",
  "skill-3-content-1": "PostgreSQL",
  "skill-3-content-2": "MySQL",
  "skill-3-content-3": "Firestore",
  "skill-3-content-4": "Firebase Realtime Database",
  "skill-3-content-5": "Microsoft SQL Server",
  "skill-3-content-6": "MongoDB",
  "skill-4-title": "Hébergement & Cloud Providers",
  "skill-4-content-1": "Google Cloud Platform",
  "skill-4-content-2": "Firebase",
  "skill-4-content-3": "Amazon Web Service",
  "skill-4-content-4": "Microsoft Azure",
  "skill-5-title": "Outils & Logiciels",
  "skill-5-content-1": "Git/Gitflow, GitHub, GiLab",
  "skill-5-content-2": "Terraform",
  "skill-5-content-3": "Figma, Adobe XD, Blender",
  "skill-5-content-4": "Suite Adobe: Illustrator, Photoshop, Premiere Pro, After Effects",
  "languages-1-title": "Français",
  "languages-1-info": "Natif",
  "languages-2-title": "Anglais",
  "languages-2-info": "Courant",
  "experience-1-title": "Software Engineer Full Stack",
  "experience-1-subTitle": "Next Gate Tech, Septembre 2022 - Avril 2023",
  "experience-1-info": "Luxembourg, Luxembourg",
  "experience-1-content-1": "Next Gate Tech est une entreprise fintech basée au Luxembourg qui fournit des solutions SaaS pour l'industrie de la gestion d'actifs. Elle se concentre sur le développement de ses services innovants pour aider les entreprises à gérer efficacement leurs portefeuilles d'actifs.",
  "experience-1-content-2": "En tant que Software Engineer Full Stack, j'ai travaillé sur le développement, la maintenance et l’amélioration du dashboard utilisé par les clients. J'ai conçu et implémenté de nouveaux modules et composants. De plus, j’ai travaillé sur la conception et l’amélioration de l’expérience utilisateur via le design et l’optimisation des performances du projet.",
  "experience-1-content-3": "L'ajout de nouveaux modules nécessitait une implémentation back-end. Pour ce faire, j'ai travaillé en collaboration avec l'équipe de Quantitative Developers et Software Engineers pour ajouter les fonctionnalités requises à l'API existante. J'ai également travaillé sur la base de données utilisée pour stocker les différentes données du dashboard.",
  "experience-1-content-4": "En plus de mon travail sur le développement front-end et back-end, j'ai également contribué à l'amélioration des bibliothèques et des outils et plateformes internes de l'entreprise pour assurer le bon fonctionnement du projet.",
  "experience-1-content-5": "Cette expérience m'a permis de développer mes compétences en développement Full Stack (React avec TypeScript, FastAPI avec Python, Firestore, GCP) et ma connaissance en design UI/UX. J'ai appris à travailler efficacement en équipe et à collaborer avec des développeurs et pour des utilisateurs finaux afin d'offrir des solutions SaaS de qualité supérieure pour l'industrie de la gestion d'actifs.",
  "experience-2-title": "Stagiaire Software Engineer",
  "experience-2-subTitle": "Next Gate Tech, Février 2022 - Août 2022",
  "experience-2-info": "Luxembourg, Luxembourg",
  "experience-2-content-1": "Au cours de mon stage chez Next Gate Tech, j'ai pu améliorer mes compétences en React (TypeScript), en Python, notamment avec le framework FastAPI. J’ai pu découvrir et comprendre le Cloud Provider Google Cloud Platform, ses différents services (Firebase, Firestore, App Engine, …) ainsi que la gestion de son infrastructure avec Terraform. Enfin, j'ai également acquis une solide expérience en méthodologie Agile SCRUM.",
  "experience-2-content-2": "La signature d'un contrat avec un client majeur a contraint Next Gate Tech à fournir un nouveau projet appelé NGX, afin de garantir que le service fourni par l'entreprise soit robuste et efficace. J'ai travaillé sur ce nouveau projet de l'entreprise, qui était une nouvelle solution SaaS pour l'industrie de gestion d'actifs. Mon travail était étroitement lié aux utilisateurs du tableau de bord de l'entreprise, et j'ai travaillé en implémentant de nouvelles fonctionnalités et de nouveaux composants web.",
  "experience-2-content-3": "J'ai également travaillé sur la mise en place d'outils et de bibliothèques en Python pour assurer le bon fonctionnement de tous les services de l'entreprise développés par les Quantitative Developers et hébergés sur GCP.",
  "experience-2-content-4": "Grâce à ce stage, j'ai acquis une expérience précieuse en développement de logiciels, ainsi qu'une solide compréhension de la collaboration au sein d'une équipe Agile et du développement de projets de grande envergure.",
  "experience-3-title": "Stagiaire Développeur Full Stack",
  "experience-3-subTitle": "Givaudan, Octobre 2020 - Janvier 2021",
  "experience-3-info": "Paris, France",
  "experience-3-content-1": "Givaudan est une entreprise suisse spécialisée dans la création de parfums, d'arômes et d'ingrédients pour l'industrie agroalimentaire et les produits de consommation. Elle est un leader de l'industrie grâce à son expertise en innovation. Mon stage s’est déroulé dans la Digital Factory de Givaudan, qui utilise les technologies numériques pour accélérer l'innovation et améliorer les processus opérationnels.",
  "experience-3-content-2": "J'ai eu la responsabilité de concevoir et développer une application web destinée à communiquer avec un robot de parfumerie pour créer de nouveaux parfums. J'ai utilisé le framework Angular (TypeScript), le framework Spring Boot (Java), une base de données PostgreSQL pour le stockage de données et Tomcat pour le déploiement de l'application web.",
  "experience-3-content-3": "Au cours de ce stage, j'ai été également chargé de réaliser le Reverse Engineering de l’application déjà existante, afin de la réécrire en utilisant les technologies mentionnées précédemment pour le projet.",
  "experience-3-content-4": "Ce stage chez Givaudan a été une expérience professionnelle très enrichissante pour moi. J'ai eu l'opportunité de développer mes compétences en tant que développeur Full Stack et de travailler sur un projet novateur dans un secteur passionnant. J'ai également appris à communiquer efficacement avec mon équipe et à résoudre des problèmes de manière autonome.",
  "project-1-title": "Cluster Control",
  "project-1-info": "Unity, C#, Photon, Firestore, Firebase",
  "project-1-content-1": "Lors de mes études, j'ai travaillé sur un projet de développement de jeu vidéo en équipe, qui visait à concevoir et développer un jeu multijoueur sur Unity. Nous avons implémenté diverses fonctionnalités, telles que du ray tracing, un système de magasin et de score, ainsi qu'un système de lobby pour les joueurs. Dans ce projet, j'ai également contribué à l'aspect graphique du jeu, en créant des designs et des modèles 3D.",
  "project-1-content-2": "Le but initial de ce projet était d'offrir une expérience ludique qui sensibilise les joueurs à l'importance des gestes sanitaires et des mesures de sécurité en temps de crise sanitaire. À travers la narration du jeu, les joueurs devaient gérer les effets de la maladie dans un village, en prenant des décisions pour éviter la propagation de la maladie et maintenir le moral des habitants.",
  "project-1-content-3": "Le projet m'a permis de mettre en pratique mes compétences en développement de jeux vidéo, ainsi qu'en conception et en résolution de problèmes. J'ai également acquis une expérience en gestion de projet, en travaillant sur un projet à long terme avec une équipe réduite.",
  "project-2-title": "Where Wear",
  "project-2-info": "React, JavaScript, HTML5, CSS3, Node.js, Nest.js, Swift, PostgreSQL",
  "project-2-content-1": "J'ai travaillé sur un projet d'équipe durant mes études, qui consistait à développer une application mobile en tant que réseau social pour le partage d'adresses de boutiques de vêtements. L'application avait pour but de permettre à chaque utilisateur de créer un profil et de partager des adresses de magasins de vêtements qu'il appréciait. Elle comporte également un fil d'actualité pour suivre les dernières tendances.",
  "project-2-content-2": "L'application a été développée sur iOS en utilisant Swift. Afin de permettre la communication entre les utilisateurs et les différents profils, nous avons également développé une API à l'aide du framework NestJS, ainsi qu'une base de données PostgreSQL. Enfin, afin de gérer les données de l'application et du fil d'actualité, nous avons créé une plateforme administrateur en ReactJS, ainsi qu'un site vitrine pour la présentation de l'application.",
  "project-2-content-3": "Ce projet m'a permis de mettre en pratique mes compétences en développement mobile et web, ainsi qu'en conception de base de données et en développement d'API.",
  "project-3-title": "Chess Game",
  "project-3-info": "Unity, C#, TypeScript, Node.js, Express.js",
  "project-3-content-1": "Ce projet personnel est un jeu d'échecs que j'ai développé sur Unity en utilisant le langage de programmation C#. J'ai travaillé sur l'aspect graphique du jeu, en créant des modèles 3D pour les pièces d'échecs et en concevant une interface utilisateur agréable.",
  "project-3-content-2": "Mon objectif était de créer une version en ligne du jeu d'échecs, c'est pourquoi j'ai également mis en place un serveur sur ExpressJS pour permettre aux joueurs de communiquer par Websockets. J'ai également implémenté un système de suggestion des coups possibles ainsi que la logique du jeu du côté serveur.",
  "project-3-content-3": "Je suis très fier de ce projet, car il m'a permis de développer mes compétences en matière de développement de jeux en ligne. J'ai également appris à travailler de manière autonome et à gérer efficacement mon temps et mes ressources pour atteindre mes objectifs."
}
